recept/src/Enums/СтавкаНДС/СтавкаНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкаНДС</name>
  <enumValues>
    <name>НДС5</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
</mdclass:Enum>

recept/src/CommonModules/РассчетЗначений/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция РассчетНДС(СуммаБезНДС, СтавкаНДС)  Экспорт
	
	СуммаНДС = 0;
	Если СтавкаНДС = Перечисления.СтавкаНДС.НДС5 Тогда
		СуммаНДС = СуммаБезНДС * 10 / 105;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.НДС10 Тогда
		СуммаНДС = СуммаБезНДС * 10 / 110;		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.НДС18 Тогда
		СуммаНДС = СуммаБезНДС * 18 / 118;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.НДС20 Тогда
		СуммаНДС = СуммаБезНДС * 20 / 120;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.НДС22 Тогда
		СуммаНДС = СуммаБезНДС * 20 / 122;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкаНДС.БезНДС Тогда
		СуммаНДС = 0;
	КонецЕсли;
	
	Возврат СуммаНДС;
КонецФункции

#КонецОбласти
